; domain
(define (domain domain_name)

    ;remove requirements that are not needed
    (:requirements :strips :fluents :typing :conditional-effects :negative-preconditions :equality :disjunctive-preconditions)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        cell
    )

    ; un-comment following line if constants are needed
    ;(:constants )
    (:constants
        cell-n-n - cell
        cell-1-0 - cell
        cell-1-1 - cell
    )

    (:predicates ;todo: define predicates here
        (connected ?from - cell ?to - cell)
        (hero-pos ?position - cell)
        (princes-pos ?position - cell)
        (block-pos ?position - cell)
        (key-pos ?position - cell)
        (goal ?position - cell)
        (dragon-pos ?position - cell)
        (sword-pos ?position - cell)
    )
    (:functions ;todo: define numeric functions here

    )

    (:action walk
        :parameters (?from - cell ?to - cell ?dragon - cell)
        :precondition (and
            (dragon-pos ?dragon)
            (not (dragon-pos ?to))
            (not (block-pos ?to))
            (hero-pos ?from)
            (not (princes-pos ?to))
            (not (key-pos ?to))
            (not (goal ?to))
            (or (connected ?from ?to) (connected ?to ?from))
        )
        :effect (and
            (not (hero-pos ?from))
            (hero-pos ?to)
            (when
                (and (dragon-pos cell-1-0))
                (and (dragon-pos cell-1-1) (not(dragon-pos ?dragon)))
            )
            (when
                (and (dragon-pos cell-1-1))
                (and (dragon-pos cell-1-0) (not(dragon-pos ?dragon)))
            )
        )
    )
    (:action walk-with-princes
        :parameters (?from - cell ?to - cell ?dragon - cell)
        :precondition (and
            (dragon-pos ?dragon)
            (not (dragon-pos ?to))
            (not (block-pos ?to))
            (hero-pos ?from)
            (princes-pos ?from)
            (or (connected ?from ?to) (connected ?to ?from))
        )
        :effect (and
            (not (hero-pos ?from))
            (hero-pos ?to)
            (not (princes-pos ?from))
            (princes-pos ?to)
            (not (key-pos ?from))
            (key-pos ?to)
            (when
                (and (dragon-pos cell-1-0))
                (and (dragon-pos cell-1-1) (not(dragon-pos ?dragon)))
            )
            (when
                (and (dragon-pos cell-1-1))
                (and (dragon-pos cell-1-0) (not(dragon-pos ?dragon)))
            )
        )
    )
    (:action walk-with-key
        :parameters (?from - cell ?to - cell ?dragon - cell)
        :precondition (and
            (dragon-pos ?dragon)
            (not (dragon-pos ?to))
            (not (block-pos ?to))
            (hero-pos ?from)
            (key-pos ?from)
            (not (goal ?to))
            ;(not (princes-pos ?to))
            (or (connected ?from ?to) (connected ?to ?from))
        )
        :effect (and
            (not (hero-pos ?from))
            (hero-pos ?to)
            (not (key-pos ?from))
            (key-pos ?to)
            (when
                (and (dragon-pos cell-1-0))
                (and (dragon-pos cell-1-1) (not(dragon-pos ?dragon)))
            )
            (when
                (and (dragon-pos cell-1-1))
                (and (dragon-pos cell-1-0) (not(dragon-pos ?dragon)))
            )
        )
    )
    (:action walk-to-unlock-princes
        :parameters (?from - cell ?to - cell ?dragon - cell)
        :precondition (and
            (dragon-pos ?dragon)
            (not (dragon-pos ?to))
            (hero-pos ?from)
            (key-pos ?from)
            (princes-pos ?to)
            (or (connected ?from ?to) (connected ?to ?from))
        )
        :effect (and
            (not (hero-pos ?from))
            (hero-pos ?to)
            (not (key-pos ?from))
            (key-pos ?to)
            (when
                (and (dragon-pos cell-1-0))
                (and (dragon-pos cell-1-1) (not(dragon-pos ?dragon)))
            )
            (when
                (and (dragon-pos cell-1-1))
                (and (dragon-pos cell-1-0) (not(dragon-pos ?dragon)))
            )
        )
    )
    (:action walk-to-pick-key
        :parameters (?from - cell ?to - cell ?dragon - cell)
        :precondition (and
            (dragon-pos ?dragon)
            (not (dragon-pos ?to))
            (hero-pos ?from)
            (key-pos ?to)
            (not (goal ?to))
            (or (connected ?from ?to) (connected ?to ?from))
        )
        :effect (and
            (not (hero-pos ?from))
            (hero-pos ?to)
            (when
                (and (dragon-pos cell-1-0))
                (and (dragon-pos cell-1-1) (not(dragon-pos ?dragon)))
            )
            (when
                (and (dragon-pos cell-1-1))
                (and (dragon-pos cell-1-0) (not(dragon-pos ?dragon)))
            )
        )
    )
    (:action walk-to-pick-sword
        :parameters (?from - cell ?to - cell ?dragon - cell)
        :precondition (and
            (dragon-pos ?dragon)
            (not (dragon-pos ?to))
            (hero-pos ?from)
            (sword-pos ?to)
            (not (goal ?to))
            (or (connected ?from ?to) (connected ?to ?from))
        )
        :effect (and
            (not (hero-pos ?from))
            (hero-pos ?to)
            (when
                (and (dragon-pos cell-1-0))
                (and (dragon-pos cell-1-1) (not(dragon-pos ?dragon)))
            )
            (when
                (and (dragon-pos cell-1-1))
                (and (dragon-pos cell-1-0) (not(dragon-pos ?dragon)))
            )
        )
    )
    (:action walk-with-sword
        :parameters (?from - cell ?to - cell ?dragon - cell)
        :precondition (and
            (dragon-pos ?dragon)
            (not (dragon-pos ?to))
            (hero-pos ?from)
            (sword-pos ?from)
            ; (not (goal ?to))
            (not (princes-pos ?to))
            (not (key-pos ?to))
            (or (connected ?from ?to) (connected ?to ?from))
        )
        :effect (and
            (not (hero-pos ?from))
            (hero-pos ?to)
            (not (sword-pos ?from))
            (sword-pos ?to)
        )
    )
    (:action walk-to-kill-dragon
        :parameters (?from - cell ?to - cell ?dragon - cell)
        :precondition (and
            (dragon-pos ?dragon)
            (dragon-pos ?to)
            (hero-pos ?from)
            (sword-pos ?from)
            (not (princes-pos ?to))
            (not (key-pos ?to))
            (not (goal ?to))
            (or (connected ?from ?to) (connected ?to ?from))
        )
        :effect (and
            (not (hero-pos ?from))
            (hero-pos ?to)
            (not (sword-pos ?from))
            (sword-pos ?to)
            (not (dragon-pos ?to))
            (dragon-pos cell-n-n)
        )
    )
)

; problem
(define (problem problem_name)
    (:domain domain_name)
    (:objects
        cell-n-n - cell
        cell-0-0 - cell
        cell-0-1 - cell
        cell-0-2 - cell
        cell-1-0 - cell
        cell-1-1 - cell
        cell-1-2 - cell
        cell-2-0 - cell
        cell-2-1 - cell
        cell-2-2 - cell
    )

    (:init
        (connected cell-0-0 cell-0-1)
        (connected cell-0-0 cell-1-0)
        (connected cell-1-1 cell-0-1)
        (connected cell-1-1 cell-1-0)
        (connected cell-0-2 cell-1-2)
        (connected cell-0-2 cell-0-1)
        (connected cell-1-1 cell-1-2)
        (connected cell-2-1 cell-2-2)
        (connected cell-2-1 cell-2-0)
        (connected cell-2-1 cell-1-1)
        (connected cell-2-0 cell-1-0)
        (connected cell-2-2 cell-1-2)
        (princes-pos cell-1-2)
        (goal cell-2-2)
        (block-pos cell-1-1)
        (key-pos cell-2-0)
        (hero-pos cell-0-0)
        (sword-pos cell-0-1)
        (dragon-pos cell-1-0)
        ;todo: put the initial state's facts and numeric values here
    )

    (:goal
        (and
            (exists
                ( ?c - cell)
                (and (goal ?c) (hero-pos ?c) (princes-pos ?c))
            )
        )
    )
)

; plan
1. (walk-to-pick-sword cell-0-0 cell-0-1 cell-1-0)
   deleted: (hero-pos cell-0-0) (dragon-pos cell-1-0)
   added: (hero-pos cell-0-1) (dragon-pos cell-1-1)
   goals met: 0 of 1
2. (walk-to-kill-dragon cell-0-1 cell-1-1 cell-1-1)
   deleted: (hero-pos cell-0-1) (sword-pos cell-0-1) (dragon-pos cell-1-1)
   added: (hero-pos cell-1-1) (sword-pos cell-1-1) (dragon-pos cell-n-n)
   goals met: 0 of 1
3. (walk-with-sword cell-1-1 cell-2-1 cell-n-n)
   deleted: (hero-pos cell-1-1) (sword-pos cell-1-1)
   added: (hero-pos cell-2-1) (sword-pos cell-2-1)
   goals met: 0 of 1
4. (walk-with-sword cell-2-1 cell-2-2 cell-n-n)
   deleted: (hero-pos cell-2-1) (sword-pos cell-2-1)
   added: (hero-pos cell-2-2) (sword-pos cell-2-2)
   goals met: 0 of 1
5. (walk cell-2-2 cell-2-1 cell-n-n)
   deleted: (hero-pos cell-2-2)
   added: (hero-pos cell-2-1)
   goals met: 0 of 1
6. (walk-to-pick-key cell-2-1 cell-2-0 cell-n-n)
   deleted: (hero-pos cell-2-1)
   added: (hero-pos cell-2-0)
   goals met: 0 of 1
7. (walk-with-key cell-2-0 cell-1-0 cell-n-n)
   deleted: (hero-pos cell-2-0) (key-pos cell-2-0)
   added: (hero-pos cell-1-0) (key-pos cell-1-0)
   goals met: 0 of 1
8. (walk-with-key cell-1-0 cell-0-0 cell-n-n)
   deleted: (hero-pos cell-1-0) (key-pos cell-1-0)
   added: (hero-pos cell-0-0) (key-pos cell-0-0)
   goals met: 0 of 1
9. (walk-with-key cell-0-0 cell-0-1 cell-n-n)
   deleted: (hero-pos cell-0-0) (key-pos cell-0-0)
   added: (hero-pos cell-0-1) (key-pos cell-0-1)
   goals met: 0 of 1
10. (walk-with-key cell-0-1 cell-0-2 cell-n-n)
   deleted: (hero-pos cell-0-1) (key-pos cell-0-1)
   added: (hero-pos cell-0-2) (key-pos cell-0-2)
   goals met: 0 of 1
11. (walk-with-key cell-0-2 cell-1-2 cell-n-n)
   deleted: (hero-pos cell-0-2) (key-pos cell-0-2)
   added: (hero-pos cell-1-2) (key-pos cell-1-2)
   goals met: 0 of 1
12. (walk-with-princes cell-1-2 cell-2-2 cell-n-n)
   deleted: (hero-pos cell-1-2) (princes-pos cell-1-2) (key-pos cell-1-2)
   added: (hero-pos cell-2-2) (princes-pos cell-2-2) (key-pos cell-2-2)
   goals met: 1 of 1
